---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotReposition
source: html/bbb2ff49-ff09-43ef-834e-f830de03bdee.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotReposition Property

Failed to reposition part.

## Syntax (C#)
```csharp
public static FailureDefinitionId PinnedFabricationPartNotReposition { get; }
```